app/controllers/admin/contacts_controller.rb

SELECT  "contacts".* FROM "contacts" WHERE "contacts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "contacts" SET "contact_status" = ?, "updated_at" = ? WHERE "contacts"."id" = ?  [["contact_status", 1], ["updated_at", "2020-08-23 06:30:16.771776"], ["id", 1]]
---
  def update
    @contact = Contact.find(params[:id])
    @contact.update(contact_params)