app/controllers/admin/genres_controller.rb

  def create
  	@genre = Genre.new(genre_params)
  	if @genre.save
---
INSERT INTO "genres" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "和食メニュー"], ["created_at", "2020-08-11 06:27:00.443408"], ["updated_at", "2020-08-11 06:27:00.443408"]]