app/controllers/admin/menus_controller.rb

SELECT "menus".* FROM "menus"
---
  def index
  	@menus = Menu.all

SELECT  "menus".* FROM "menus" WHERE "menus"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
  	@menu = Menu.find(params[:id])

SELECT  "menus".* FROM "menus" WHERE "menus"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "menus" SET "status" = ?, "updated_at" = ? WHERE "menus"."id" = ?  [["status", 1], ["updated_at", "2020-08-13 07:03:32.623065"], ["id", 1]]
---
  def update
  	@menu = Menu.find(params[:id])
  	@menu.update(menu_params)