app/views/public/menus/_menu.html.erb

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."menu_id" = ?  [["menu_id", 1]]
---
					<% end %>
					<p>お気に入りされた数：<%= menu.favorites.count %></p>