app/views/public/menus/edit.html.erb

				<th><%= f.label :genre_id, "ジャンル" %></th>
				<td><%= f.collection_select :genre_id, Genre.all, :id, :name %></td>
---
SELECT "genres".* FROM "genres"