app/views/public/menus/index.html.erb

					</p>
					<p>お気に入りされた数：<%= menu.favorites.count %></p>
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."menu_id" = ?  [["menu_id", 1]]