app/views/public/menus/new.html.erb

SELECT "genres".* FROM "genres"
---
				<th><%= f.label :genre_id, "ジャンル" %></th>
				<td><%= f.collection_select :genre_id, Genre.all, :id, :name %></td>