app/views/public/menus/show.html.erb

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."menu_id" = ?  [["menu_id", 1]]
---
	              		<% end %>
	              		お気に入りされた数：<%= @menu.favorites.count%>