app/controllers/public/contacts_controller.rb

INSERT INTO "contacts" ("name", "email", "message", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "中西小学校"], ["email", "nakanisi@gmail.com"], ["message", "登録ができません"], ["created_at", "2020-08-20 07:22:53.587023"], ["updated_at", "2020-08-20 07:22:53.587023"]]
---
  def create
  	@contact = Contact.new(contact_params)
    @contact.save