app/controllers/public/favorites_controller.rb

  def index
    @menus = current_school.favorite_menus.page(params[:page]).per(8)
---
SELECT COUNT(*) FROM "menus"

  def create
  	@menu = Menu.find(params[:menu_id])
  	favorite = @menu.favorites.new(school_id: current_school.id)
  	favorite.save
---
SELECT  "menus".* FROM "menus" WHERE "menus"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "favorites" ("school_id", "menu_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["school_id", 1], ["menu_id", 1], ["created_at", "2020-08-24 12:51:41.695826"], ["updated_at", "2020-08-24 12:51:41.695826"]]

  def destroy
  	@menu = Menu.find(params[:menu_id])
  	favorite = @menu.favorites.find_by(school_id: current_school.id)
  	favorite.destroy
---
SELECT  "menus".* FROM "menus" WHERE "menus"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "favorites".* FROM "favorites" WHERE "favorites"."menu_id" = ? AND "favorites"."school_id" = ? LIMIT ?  [["menu_id", 2], ["school_id", 1], ["LIMIT", 1]]
DELETE FROM "favorites" WHERE "favorites"."id" = ?  [["id", 25]]