app/controllers/public/homes_controller.rb

SELECT  "menus".* FROM "menus" WHERE "menus"."status" = ? ORDER BY RANDOM() LIMIT ?  [["status", 0], ["LIMIT", 3]]
---
	def top
		@random = Menu.where(status: :公開中).order("RANDOM()").limit(3)