app/controllers/public/homes_controller.rb

	def top
		@random = Menu.order("RANDOM()").limit(3)
---
SELECT  "menus".* FROM "menus" ORDER BY RANDOM() LIMIT ?  [["LIMIT", 3]]