app/controllers/public/menus_controller.rb

  def index
    @menus = Menu.where(status: :公開中).page(params[:page]).per(8)
---
SELECT  "menus".* FROM "menus" WHERE "menus"."status" = ? LIMIT ? OFFSET ?  [["status", 0], ["LIMIT", 8], ["OFFSET", 0]]
SELECT COUNT(*) FROM "menus" WHERE "menus"."status" = ?  [["status", 0]]

  def show
    @menu = Menu.find(params[:id])
---
SELECT  "menus".* FROM "menus" WHERE "menus"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def create
    @menu = Menu.new(menu_params)
    @menu.school_id = current_school.id
    @menu.save
---
INSERT INTO "menus" ("school_id", "genre_id", "title", "staple_food", "main_dish", "side_dish", "soup", "dessert", "drink", "energy", "protein", "fat", "sodium", "comment", "image_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def edit
    @menu = Menu.find(params[:id])
---
SELECT  "menus".* FROM "menus" WHERE "menus"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    @menu = Menu.find(params[:id])
    @menu.update(menu_params)
---
SELECT  "menus".* FROM "menus" WHERE "menus"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "menus" SET "image_id" = ?, "updated_at" = ? WHERE "menus"."id" = ?  [["image_id", "a664c051a783419b09f67c6db38504b479f9f721a8b2b69230b6957679ac"], ["updated_at", "2020-08-12 08:49:01.110622"], ["id", 2]]