app/controllers/public/schools_controller.rb

SELECT  "schools".* FROM "schools" WHERE "schools"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "menus".* FROM "menus" WHERE "menus"."school_id" = ?  [["school_id", 1]]
SELECT COUNT(*) FROM "menus" WHERE "menus"."school_id" = ?  [["school_id", 1]]
---
  def show
    @school = School.find(params[:id])
    @menus = @school.menus.page(params[:page]).per(8)

SELECT  "schools".* FROM "schools" WHERE "schools"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @school = School.find(params[:id])

SELECT  "schools".* FROM "schools" WHERE "schools"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "schools" SET "street_address" = ?, "updated_at" = ? WHERE "schools"."id" = ?  [["street_address", "東京都足立区北千住１−１−２"], ["updated_at", "2020-08-13 08:12:00.430927"], ["id", 1]]
---
  def update
    @school = School.find(params[:id])
    @school.update(school_params)