app/views/public/schools/show.html.erb

				</td>
				<td>お気に入り数：<%= menu.favorites.count%></td>
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."menu_id" = ?  [["menu_id", 1]]